--[[
--------------------------------------------------------------------------------
Copyright (c) 2025 Vanishing Games. All Rights Reserved.
Author: VanishXiao
Date: 2026-07-07 15:42:05
LastEditTime: 2026-07-07 16:14:16
--------------------------------------------------------------------------------
--]]

-- 算数运算符
-- + - * / % ^
-- 没有自增, 复合(+= ...)

print(1.41 + 3)
print("1.34" * 78) -- 字符串会被自动转换为数值来计算
print("2" ^ 3) -- Lua可以使用幂运算

print("===========================")

-- 条件运算符
print(3~=1) -- ~= 是不等于而不是 !=

print("===========================")

-- 逻辑运算符
-- and or not
-- lua中只有 false 和 nil 为false
print (1 and 2)
print (0 or not 1)-- lua支持"短路", 所以0为true直接就返回了
print (not 0 or print("差点被短路了"))

-- 位运算符
-- 不支持, 需要三方库实现

-- 三目运算符
-- 不支持